blog-posts/2008-07-27-eclipse-to-emacs-navigating-your-source-tree.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Eclipse to Emacs: Navigating your source tree</title>
<!-- 2015-01-07 Wed 14:55 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link href='http://fonts.googleapis.com/css?family=Open+Sans' rel='stylesheet' type='text/css'></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Eclipse to Emacs: Navigating your source tree</h1>
<p>
July 27th, 2008 -
<a href="http://sachachua.com/blog/p/4998"><a href="http://sachachua.com/blog/p/4998">http://sachachua.com/blog/p/4998</a></a>
</p>

<p>
Two other things I like about the Eclipse development environment are
the ability to jump to a function definition and the ability to open any
resource in the workspace. Fortunately, these shortcuts are easy to
duplicate in Emacs.
</p>

<p>
<a href="http://ctags.sourceforge.net/">Exuberant Ctags</a> is a utility that
builds an index of the function definitions in your source code. You can
use this index to jump to any function definition using editors such as
vi or emacs. To index your Drupal source code, for example, go to the
root of your source directory and use a command like this:
</p>

<pre class="example">
find . -name \*.module -o -name \*.php -o -name \*.inc -o -name \*.install -o -name \*.engine -o -name \*.profile | etags -l php -
</pre>

<p>
To use this index in Emacs, add the following code to your ~/.emacs,
changing drupal-project-path as necessary:
</p>

<pre class="example">
(defvar drupal-project-path "~/proj/example" "*Base path for your project")

(require 'etags)
(setq tags-file-name (expand-file-name "TAGS" drupal-project-path))
</pre>

<p>
Evaluate the code. You can then use M-. (find-tag) to jump to the
declaration of a function in your project.
</p>

<p>
To open any resource in your source tree with a few keystrokes, index
the files with filecache and use ido to open the file. Ido is well worth
learning how to use. Here's the code I use, taken almost directly from
the filecache documentation:
</p>

<pre class="example">
(require 'filecache)
(require 'ido)
(defun file-cache-ido-find-file (file)
  "Using ido, interactively open file from file cache'.
First select a file, matched using ido-switch-buffer against the contents
in `file-cache-alist'. If the file exist in more than one
directory, select directory. Lastly the file is opened."
  (interactive (list (file-cache-ido-read "File: "
                                          (mapcar
                                           (lambda (x)
                                             (car x))
                                           file-cache-alist))))
  (let* ((record (assoc file file-cache-alist)))
    (find-file
     (expand-file-name
      file
      (if (= (length record) 2)
          (car (cdr record))
        (file-cache-ido-read
         (format "Find %s in dir: " file) (cdr record)))))))

(defun file-cache-ido-read (prompt choices)
  (let ((ido-make-buffer-list-hook
     (lambda ()
       (setq ido-temp-list choices))))
    (ido-read-buffer prompt)))

(ido-mode t)
;; Change this to filter out your version control files
(add-to-list 'file-cache-filter-regexps "\\.svn-base$")
(if drupal-project-path
    (file-cache-add-directory-using-find drupal-project-path))

(global-set-key (kbd "ESC ESC f") 'file-cache-ido-find-file)
</pre>

<p>
This turns ESC ESC f into a handy shortcut for finding files anywhere in
your project tree. Read the source code (ido.el) for more information on
ido shortcuts.
</p>

<p>
Good luck and have fun!
</p>

<p>
(UPDATE: Added “.” to the find command &#x2013; two people suggested it! =) )
 (UPDATE: Forced etags to detect files as php and added .engine and
.profile to the list of extensions)
 (UPDATE: Added version control filter for file-cache)
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
